# -*- coding: utf-8 -*-
# author:shihua
# coder:shihua
# 这是一个抽象栈类，主要用于顺序存储
"""
模块介绍
-------

这是一个抽象栈类，主要用于顺序存储

    功能：
                                                                     
        （1）提供顺序存储功能                                                                                                                                                                                                                                                    

类说明
------

"""


####### 载入程序包 ##########################################################
############################################################################



from AlgorithmManager.GraphDataFrame.abstractcollection import AbstractCollection



####### 抽象栈类 #############################################################
### 功能：                                                                 ###
### （1）提供顺序存储功能                                                    ###
##############################################################################



####### 抽象栈类 ##################################################################################
##################################################################################################



class AbstractStack(AbstractCollection):
    """
    类介绍：

        这是一个抽象栈类，提供顺序存储功能
    """


    def __init__(self,sourceCollection = None):
        """
        属性方法功能：

            定义一个继承抽象集合的属性
        """

        AbstractCollection.__init__(self,sourceCollection)


    def add(self,item):
        """
        方法功能：

            定义一个添加元素的方法
        """
        
        self.push(item)



#####################################################################################################
#####################################################################################################


