# -*- coding: utf-8 -*-
# author:shihua
# coder:shihua
# 这是一个转换工具类
"""
模块介绍
-------

这是一个转换工具类

    功能：                     

        （1）DAG描述转换                                                        

        （2）栈转双头队列                                                       

类说明
------

"""



####### 载入程序包 ##########################################################
############################################################################



from collections import deque



####### 转换工具 #############################################################
### 功能：                                                                 ###
### （1）DAG描述转换                                                        ###
### （2）栈转双头队列                                                       ###
#############################################################################



####### DAG描述转换 ###################################################################################
######################################################################################################



def trans_rep(tmp_rep):
    """
    函数功能：

        定义一个DAG描述转换的函数

    参数：
        tmp_rep (str)：DAG描述

    返回：
        返回 (str)：符合自定义图数据模型规范的描述
    """

    tmp_rep_list = tmp_rep.split(',')
    new_rep_list = []
    for tmp_item in tmp_rep_list:
        tmp_item_list = tmp_item.split('->')
        a = tmp_item_list[0]
        b = tmp_item_list[1]
        new_item = b + '>' + a +':0'
        new_rep_list.append(new_item)
    symbol = ' '
    trans_rep_list = symbol.join(new_rep_list)
    return trans_rep_list



####### 栈转双头队列 ##########################################################################################
##############################################################################################################



def trans_stack(stack):
    '''
    函数功能：

        定义一个栈转换为双头队列的函数

    参数：
        stack (class)：自定义的栈,自定义的数据结构

    返回：
        topoSort_deque (list): 拓扑排序结果
    '''

    topoSort_deque = deque()
    for tmp_item in stack:
        tmp_item = tmp_item.getLabel()
        topoSort_deque.append(tmp_item)
    return topoSort_deque



#########################################################################################################
#########################################################################################################


